#include<stdio.h>
void menu() {
	printf("******************************************************************\n");
	printf("\n");
	printf("1-----创建一个单链表                        2-----创建一个双向链表\n");
	printf("3-----单链表奇偶调换                        4-----找到单链表的中点\n");
	printf("5-----判断链表是否成环  6-----反转链表 7----释放链表 8----遍历链表\n");
	printf("\n");
	printf("******************************************************************\n");
	printf("请输入选择编号\n");
}
void menu2() {
	printf("******************************************************************\n");
	printf("\n");
	printf("1-----以递归方式实现                          2-----以迭代方式实现\n");
	printf("\n");
	printf("******************************************************************\n");
	printf("请输入选择编号\n");
}
void menu3() {
	printf("******************************************************************\n");
	printf("\n");
	printf("1-----遍历单链表                                  2-----遍历双链表\n");
	printf("\n");
	printf("******************************************************************\n");
	printf("请输入选择编号\n");
}
void menu4() {
	printf("******************************************************************\n");
	printf("\n");
	printf("1-----销毁单链表                                  2-----销毁双链表\n");
	printf("\n");
	printf("******************************************************************\n");
	printf("请输入选择编号\n");
}